Дневник_Инвестора/src/Enums/УровниРискаЭмитента/УровниРискаЭмитента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>УровниРискаЭмитента</name>
  <enumValues>
    <name>Высокий</name>
  </enumValues>
  <enumValues>
    <name>Низкий</name>
  </enumValues>
  <enumValues>
    <name>Средний</name>
  </enumValues>
</mdclass:Enum>

Дневник_Инвестора/src/Catalogs/Облигации/Облигации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Облигации</name>
  <attributes>
    <name>Тикер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ISIN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Номинал</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Эмитент</name>
    <type>
      <types>CatalogRef.Эмитенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПогашения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

Дневник_Инвестора/src/Catalogs/СектораЭкономики/СектораЭкономики.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СектораЭкономики</name>
  <predefined>
    <items>
      <name>Государство</name>
      <description>Государство</description>
    </items>
    <items>
      <name>IT</name>
      <description>IT</description>
    </items>
    <items>
      <name>Финансы</name>
      <description>Финансы</description>
    </items>
    <items>
      <name>Здравоохранение</name>
      <description>Здравоохранение</description>
    </items>
    <items>
      <name>Энергетика</name>
      <description>Энергетика</description>
    </items>
    <items>
      <name>Промышленность</name>
      <description>Промышленность</description>
    </items>
    <items>
      <name>Недвижимость</name>
      <description>Недвижимость</description>
    </items>
    <items>
      <name>КоммунальноеХозяйство</name>
      <description>Коммунальное хозяйство</description>
    </items>
    <items>
      <name>Телекоммуникации</name>
      <description>Телекоммуникации</description>
    </items>
    <items>
      <name>Муниципальный</name>
      <description>Муниципальный</description>
    </items>
    <items>
      <name>ПотребительскийСектор</name>
      <description>Потребительский сектор</description>
    </items>
    <items>
      <name>Сырьё</name>
      <description>Сырьё</description>
    </items>
    <items>
      <name>Прочее</name>
      <description>Прочее</description>
    </items>
  </predefined>
</mdclass:Catalog>

Дневник_Инвестора/src/Catalogs/Эмитенты/Эмитенты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Эмитенты</name>
  <attributes>
    <name>Сектор</name>
    <type>
      <types>CatalogRef.СектораЭкономики</types>
    </type>
  </attributes>
  <attributes>
    <name>УровеньРиска</name>
    <comment>Внутренний уровень риска (Оцененный Т-Банком)</comment>
    <type>
      <types>EnumRef.УровниРискаЭмитента</types>
    </type>
  </attributes>
</mdclass:Catalog>

Дневник_Инвестора/src/CommonModules/ИнтеграционныйМодульТБанкСлужебный/Module.bsl
#Область СлужебныйПрограммныйИнтерфейс

Процедура РазобратьОтветПоСпискуОблигаций(Ответ) Экспорт 
	
	ДанныеОблигаций = НовыйАдаптерОблигациийИнтеграционнойЧастиВБизнесЛогику();
	
	Для Каждого Инструменты Из Ответ Цикл
		Облигации = Инструменты.Значение;
		Для Каждого Облигация Из Облигации Цикл
			СтрокаОблигаций = ДанныеОблигаций.Добавить();
			СтрокаОблигаций.Наименование = Облигация["name"];
			СтрокаОблигаций.ISIN = Облигация["isin"];
			СтрокаОблигаций.Тикер = Облигация["ticker"];
			СтрокаОблигаций.Валюта = ВРег(Облигация["currency"]);
			СтрокаОблигаций.Сектор = Облигация["sector"];
			СтрокаОблигаций.Эмитент = ЭмитентОблигацииПоНаименованию(СтрокаОблигаций.Наименование);
			СтрокаОблигаций.СтранаЭмитент = Облигация["countryOfRiskName"];
			СтрокаОблигаций.ДатаПогашения = ПрочитатьДатуJSON(Облигация["maturityDate"], ФорматДатыJSON.ISO);
			СтрокаОблигаций.Номинал = Число(Облигация["nominal"]["units"]);
			СтрокаОблигаций.УровеньРиска = Облигация["riskLevel"];
		КонецЦикла;
	КонецЦикла;
	
	ПреобразоватьДанныеОблигацийВБизнесЛогику(ДанныеОблигаций);
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции  

Функция НовыйАдаптерОблигациийИнтеграционнойЧастиВБизнесЛогику()  
	
	ДанныеОблигаций = Новый ТаблицаЗначений;
	ДанныеОблигаций.Колонки.Добавить("Наименование", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ДанныеОблигаций.Колонки.Добавить("Валюта", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ДанныеОблигаций.Колонки.Добавить("Сектор", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ДанныеОблигаций.Колонки.Добавить("Эмитент", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ДанныеОблигаций.Колонки.Добавить("СтранаЭмитент", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	ДанныеОблигаций.Колонки.Добавить("Тикер", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ДанныеОблигаций.Колонки.Добавить("ISIN", ОбщегоНазначения.ОписаниеТипаСтрока(20));
	ДанныеОблигаций.Колонки.Добавить("ДатаПогашения", ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.Дата));
	ДанныеОблигаций.Колонки.Добавить("Номинал", ОбщегоНазначения.ОписаниеТипаЧисло(10)); 
	ДанныеОблигаций.Колонки.Добавить("УровеньРиска", ОбщегоНазначения.ОписаниеТипаСтрока(50));
	
	Возврат ДанныеОблигаций;
	
КонецФункции

// Эмитент облигации по наименованию.
// 
// Штатное наименование состоит из последовательности слов разделенных пробелом.
// Пример: Казахстан выпуск 11, ОФЗ 26228, Атомэнергопром 001Р-10 и пр.
// Первым словом, штатно обозначают эмитента.
// 
// Параметры:
//  Наименование - Строка - Полное наименование облигации
//  
// Возвращаемое значение:
//  Строка - Эмитент облигации по наименованию
//
Функция ЭмитентОблигацииПоНаименованию(Наименование)
	
	ДанныеЭмитента = СтрРазделить(Наименование, " ");
	
	Эмитент = "";
	Если ДанныеЭмитента.Количество() > 0 Тогда
		Эмитент = ДанныеЭмитента[0];
	КонецЕсли;
	
	Возврат Эмитент;
	
КонецФункции

Процедура ПреобразоватьДанныеОблигацийВБизнесЛогику(ДанныеОблигаций)
	
	СписокНовыхОблигаций = СписокОблигацийНеподгруженныхВСистему(ДанныеОблигаций);
	
	СписокЭмитентов = СписокЭмитентовПоДаннымОблигаций(ДанныеОблигаций);
	Валюты = СписокВалютПоДаннымОблигаций(ДанныеОблигаций);
	
	Для Каждого Облигация Из СписокНовыхОблигаций Цикл
		Параметры = Справочники.Облигации.НовыйПараметрыОблигации();
		ЗаполнитьЗначенияСвойств(Параметры, Облигация);	
		Параметры.Эмитент = СписокЭмитентов[Облигация.Эмитент];
		Параметры.Валюта = Валюты[Облигация.Валюта];
		Справочники.Облигации.СоздатьНовыйЭлемент(Параметры);	
	КонецЦикла;
	
КонецПроцедуры

Функция ОценкаУровняРиска()
	
	ОценкаУровняРиска = Новый Соответствие;
	ОценкаУровняРиска.Вставить("RISK_LEVEL_LOW", Перечисления.УровниРискаЭмитента.Низкий);
	ОценкаУровняРиска.Вставить("RISK_LEVEL_MEDIUM", Перечисления.УровниРискаЭмитента.Средний);
	ОценкаУровняРиска.Вставить("RISK_LEVEL_HIGH", Перечисления.УровниРискаЭмитента.Высокий);
	
	Возврат ОценкаУровняРиска;
	
КонецФункции

Функция СектораЭкономики()
	
	СектораЭкономики = Новый Соответствие;
	СектораЭкономики.Вставить("government", Справочники.СектораЭкономики.Государство);
	СектораЭкономики.Вставить("financial", Справочники.СектораЭкономики.Финансы);
	СектораЭкономики.Вставить("materials", Справочники.СектораЭкономики.Сырьё);
	СектораЭкономики.Вставить("consumer", Справочники.СектораЭкономики.ПотребительскийСектор);
	СектораЭкономики.Вставить("real_estate", Справочники.СектораЭкономики.Недвижимость);
	СектораЭкономики.Вставить("industrials", Справочники.СектораЭкономики.Промышленность);
	СектораЭкономики.Вставить("telecom", Справочники.СектораЭкономики.Телекоммуникации);
	СектораЭкономики.Вставить("utilities", Справочники.СектораЭкономики.КоммунальноеХозяйство);
	СектораЭкономики.Вставить("municipal", Справочники.СектораЭкономики.Муниципальный);
	СектораЭкономики.Вставить("it", Справочники.СектораЭкономики.IT);
	СектораЭкономики.Вставить("health_care", Справочники.СектораЭкономики.Здравоохранение);
	СектораЭкономики.Вставить("other", Справочники.СектораЭкономики.Прочее);
	СектораЭкономики.Вставить("energy", Справочники.СектораЭкономики.Энергетика);
	СектораЭкономики.Вставить("", Справочники.СектораЭкономики.ПустаяСсылка());
	
	Возврат СектораЭкономики;
	
КонецФункции

Функция СписокОблигацийНеподгруженныхВСистему(ДанныеОблигаций)

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеОблигаций.Наименование КАК Наименование,
	|	ДанныеОблигаций.Валюта КАК Валюта,
	|	ДанныеОблигаций.Сектор КАК Сектор,
	|	ДанныеОблигаций.Эмитент КАК Эмитент,
	|	ДанныеОблигаций.СтранаЭмитент КАК СтранаЭмитент,
	|	ДанныеОблигаций.Тикер КАК Тикер,
	|	ДанныеОблигаций.ISIN КАК ISIN,
	|	ДанныеОблигаций.ДатаПогашения КАК ДатаПогашения,
	|	ДанныеОблигаций.Номинал КАК Номинал,
	|	ДанныеОблигаций.УровеньРиска КАК УровеньРиска
	|ПОМЕСТИТЬ ВТ_ДанныеОблигаций
	|ИЗ
	|	&ДанныеОблигаций КАК ДанныеОблигаций
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	ISIN
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеОблигаций.Наименование КАК Наименование,
	|	ВТ_ДанныеОблигаций.Валюта КАК Валюта,
	|	ВТ_ДанныеОблигаций.Сектор КАК Сектор,
	|	ВТ_ДанныеОблигаций.Эмитент КАК Эмитент,
	|	ВТ_ДанныеОблигаций.СтранаЭмитент КАК СтранаЭмитент,
	|	ВТ_ДанныеОблигаций.Тикер КАК Тикер,
	|	ВТ_ДанныеОблигаций.ISIN КАК ISIN,
	|	ВТ_ДанныеОблигаций.ДатаПогашения КАК ДатаПогашения,
	|	ВТ_ДанныеОблигаций.Номинал КАК Номинал,
	|	ВТ_ДанныеОблигаций.УровеньРиска КАК УровеньРиска
	|ИЗ
	|	ВТ_ДанныеОблигаций КАК ВТ_ДанныеОблигаций
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Облигации КАК Облигации
	|		ПО ВТ_ДанныеОблигаций.ISIN = Облигации.ISIN
	|ГДЕ
	|	Облигации.Ссылка ЕСТЬ NULL";

	Запрос.УстановитьПараметр("ДанныеОблигаций", ДанныеОблигаций);

	Возврат Запрос.Выполнить().Выгрузить();

КонецФункции

Функция СписокЭмитентовПоДаннымОблигаций(ДанныеЭмитентов)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДанныеЭмитентов.Сектор КАК Сектор,
	|	ДанныеЭмитентов.Эмитент КАК Эмитент,
	|	ДанныеЭмитентов.СтранаЭмитент КАК СтранаЭмитент,
	|	ДанныеЭмитентов.УровеньРиска КАК УровеньРиска
	|ПОМЕСТИТЬ ВТ_ДанныеЭмитентов
	|ИЗ
	|	&ДанныеЭмитентов КАК ДанныеЭмитентов
	|ИНДЕКСИРОВАТЬ ПО
	|	Эмитент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеЭмитентов.Эмитент КАК Эмитент,
	|	ВТ_ДанныеЭмитентов.Сектор КАК Сектор,
	|	ВТ_ДанныеЭмитентов.СтранаЭмитент КАК СтранаЭмитент,
	|	ВТ_ДанныеЭмитентов.УровеньРиска КАК УровеньРиска,
	|	ЕСТЬNULL(Эмитенты.Ссылка, ЗНАЧЕНИЕ(Справочник.Эмитенты.ПустаяСсылка)) КАК Ссылка
	|ИЗ
	|	ВТ_ДанныеЭмитентов КАК ВТ_ДанныеЭмитентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Эмитенты КАК Эмитенты
	|		ПО ВТ_ДанныеЭмитентов.Эмитент = Эмитенты.Наименование
	|";
	
	Запрос.УстановитьПараметр("ДанныеЭмитентов", ДанныеЭмитентов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СписокЭмитентовПоДаннымОблигаций = Новый Соответствие;
	
	СектораЭкономики = СектораЭкономики();
	ОценкиРиска = ОценкаУровняРиска();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) Тогда
			СписокЭмитентовПоДаннымОблигаций.Вставить(ВыборкаДетальныеЗаписи.Эмитент, ВыборкаДетальныеЗаписи.Ссылка);
		Иначе
			Элемент = НовыйЭлементЭмитента(ВыборкаДетальныеЗаписи, СектораЭкономики, ОценкиРиска);
			СписокЭмитентовПоДаннымОблигаций.Вставить(ВыборкаДетальныеЗаписи.Эмитент, Элемент);		
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СписокЭмитентовПоДаннымОблигаций;
	
КонецФункции

Функция НовыйЭлементЭмитента(ВыборкаДетальныеЗаписи, СектораЭкономики, ОценкиРиска)

	Параметры = Справочники.Эмитенты.НовыйПараметрыЭмитента();
	Параметры.Наименование = ВыборкаДетальныеЗаписи.Эмитент;
	Параметры.Сектор = СектораЭкономики[ВыборкаДетальныеЗаписи.Сектор];
	Параметры.УровеньРиска = ОценкиРиска[ВыборкаДетальныеЗаписи.УровеньРиска];
	Возврат Справочники.Эмитенты.СоздатьНовыйЭлемент(Параметры);
	
КонецФункции

Функция СписокВалютПоДаннымОблигаций(ДанныеВалют)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ДанныеВалют.Валюта КАК Валюта
	|ПОМЕСТИТЬ ВТ_ДанныеВалют
	|ИЗ
	|	&ДанныеВалют КАК ДанныеВалют
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Валюта
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_ДанныеВалют.Валюта КАК Валюта,
	|	ЕСТЬNULL(Валюты.Ссылка, ЗНАЧЕНИЕ(Справочник.Валюты.ПустаяСсылка)) КАК Ссылка
	|ИЗ
	|	ВТ_ДанныеВалют КАК ВТ_ДанныеВалют
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ВТ_ДанныеВалют.Валюта = Валюты.Наименование
	|";
	
	Запрос.УстановитьПараметр("ДанныеВалют", ДанныеВалют);
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СписокВалютПоДаннымОблигаций = Новый Соответствие;
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл	
		СписокВалютПоДаннымОблигаций.Вставить(ВыборкаДетальныеЗаписи.Валюта, ВыборкаДетальныеЗаписи.Ссылка);	
	КонецЦикла;
	
	Возврат СписокВалютПоДаннымОблигаций;
	
КонецФункции

#КонецОбласти
